{"format": "graph-model", "generatedBy": "2.12.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "13"}]}}, "input_2:0": {"name": "input_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "13"}]}}}, "outputs": {"output": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "13"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_2", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "13"}]}}}}, {"name": "Func/StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/input_control_node/_18", "op": "NoOp", "input": ["^input_1", "^input_2"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_29_1/Cast/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/input_control_node/_18"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "13"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_35_1/Add/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/input_control_node/_18"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_29_1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/input_control_node/_18"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_30_1/Cast/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/input_control_node/_18"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_34_1/Cast/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/input_control_node/_18"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_30_1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/input_control_node/_18"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_31_1/Cast/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/input_control_node/_18"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "13"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_34_1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/input_control_node/_18"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_31_1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/input_control_node/_18"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_32_1/Cast/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/input_control_node/_18"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_32_1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/input_control_node/_18"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_35_1/Cast/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/input_control_node/_18"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/concatenate_4_1/concat/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/input_control_node/_18"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_33_1/Cast/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/input_control_node/_18"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_33_1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/input_control_node/_18"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_29_1/Relu", "op": "_FusedMatMul", "input": ["input_1", "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_29_1/Cast/ReadVariableOp", "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_29_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_31_1/Relu", "op": "_FusedMatMul", "input": ["input_2", "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_31_1/Cast/ReadVariableOp", "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_31_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_30_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_29_1/Relu", "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_30_1/Cast/ReadVariableOp", "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_30_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_32_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_31_1/Relu", "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_32_1/Cast/ReadVariableOp", "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_32_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/concatenate_4_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_30_1/Relu", "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_32_1/Relu", "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/concatenate_4_1/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_33_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/concatenate_4_1/concat", "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_33_1/Cast/ReadVariableOp", "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_33_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_34_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_33_1/Relu", "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_34_1/Cast/ReadVariableOp", "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_34_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_35_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_34_1/Relu", "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_35_1/Cast/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_35_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_35_1/MatMul", "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_35_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_35_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1395}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_29_1/Cast/ReadVariableOp", "shape": [13, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_35_1/Add/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_29_1/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_30_1/Cast/ReadVariableOp", "shape": [32, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_34_1/Cast/ReadVariableOp", "shape": [32, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_30_1/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_31_1/Cast/ReadVariableOp", "shape": [13, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_34_1/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_31_1/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_32_1/Cast/ReadVariableOp", "shape": [32, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_32_1/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_35_1/Cast/ReadVariableOp", "shape": [16, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/concatenate_4_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_33_1/Cast/ReadVariableOp", "shape": [32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommendation_model_5/keras_layer_17/StatefulPartitionedCall/StatefulPartitionedCall/functional_4_1/dense_33_1/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}]}]}